[{
        "idtestimonials": 1,
        "name": "Brandon Rojo",
        "testimonial": "Vince provided me with structure when I had no idea what I was doing. Whenever something wasn't going right he'd have answer to help fix the problem and come out stronger. In just over a years time he raised my squat 80lb. Bench went up 50lb. Deadlift went up 90lb. He also taught me pails and rails which are major key. ",
        "pic_path": "1.jpg"
    },
    {
        "idtestimonials": 2,
        "name": "Alex Posada",
        "testimonial": "I really enjoy working with Vince. He's always giving good feedback and helping me to make improvements in all of my lifts. 10/10 coach!! ",
        "pic_path": "2.png"
    },
    {
        "idtestimonials": 3,
        "name": "Michael Izzolo",
        "testimonial": "VVSC is like magic. In a year I put 90lbs on my bench alone. Last year, I developed chronic quad tendonitis that Vincent helped me to mend. I couldn't squat, let alone get off the couch, and now I'm squatting more than I ever did and with zero pain! Vince truly cares about his clients. ",
        "pic_path": "3.jpg"
    },
    {
        "idtestimonials": 4,
        "name": "Crystal Alfaro",
        "testimonial": "Vincent Victorero was referred to me by one of my teammates from the FIU Powerlifting Club. I was new to the team at the time, so I needed guidance and Vince was the perfect candidate! He has trained me for almost a year now and has made me feel confident about my lifts. There are times when I get frustrated or unmotivated with either the weight on the bar or my technique and Vince has helped me overcome those obstacles. As new teammates join the club, I refer them to Coach Vince because he caters to each one of his clients; for example, I, myself, was injured doing a lift and Vince gave me specific workouts for that particular muscle injury. I am grateful to have him as a coach and look forward to continue being his client.",
        "pic_path": "4.png"
    },
    {
        "idtestimonials": 5,
        "name": "Christopher Perez",
        "testimonial": "Before starting to train with Vincent, I bulged a disc in my cervical spine. He helped me rehabilitate my injury and start training again. When we started, my best total was 1101 lbs at 163 pounds, which was made up from a 396 squat, 248 bench, and a 451 deadlift. After 7 months of training, I was able to total 1333 lbs at the same bodyweight. My squat went up to 474 lbs, my bench increased to 330 lbs, and my deadlift increased to 529 lbs. This total earned me a 438 wilks which won me the title of best lifter at the Florida State Collegiate championships. Vince works with you to create a personalized plan to help you succeed. This was especially important for me since I am an injured athlete. ",
        "pic_path": "5.jpg"
    },
    {
        "idtestimonials": 6,
        "name": "Tobias Faucher",
        "testimonial": "Vince is one of the most professional and knowledgeable coaches around. I swear he works his magic every time and I've been seeing nothing but improvements during my time with him. ",
        "pic_path": "6.jpg"
    },
    {
        "idtestimonials": 7,
        "name": "Luke Vignau",
        "testimonial": "FIU powerlifting has been one of my most rewarding college experiences. Being part of the team has really motivated me to be comfortable with fighting through my barriers and become my strongest self.",
        "pic_path": "7.jpg"
    },
    {
        "idtestimonials": 8,
        "name": "Jennifer Kurver",
        "testimonial": "Vince is a great online coach. He is very knowledgeable and customizes programs based on the lifters needs. He is very responsive, and answers all of my questions. He coached me through my first meet, and gave me the tools I needed to succeed. I came from a zero bench background to benching 135+ for reps in less than a year.",
        "pic_path": ""
    },
    {
        "idtestimonials": 9,
        "name": "Sebastian Camargo ",
        "testimonial": "I really enjoy being coached by Vincent. I've had other coaches but none have been as hands-on and concerned with my progress as he has been. I look forward to each of my workouts and I've been able to see significant strength progression in just a few weeks. I've been coached by Vincent for less than a year and my lifts have improved significantly, adding close to 200lbs to my total. I'm excited to see where his strength coaching will take me, and I'm glad to be part of his team. It is clear that he has a great deal of knowledge about fitness and strength, and it shows in his coaching. ",
        "pic_path": "9.png"
    },
    {
        "idtestimonials": 10,
        "name": "Richard llanes ",
        "testimonial": "I've been with vince since December 2016 and have changed my training mentality for the better. perceived excursion training has really helped me develope into a overall better lifter and has allowed me to build my form over the last few months cause of Vince's coaching I have gained close to 100+ and I say that cause I have no actual idea of wear my 1rm is seeing as I haven't tested it in over 7 months I'm sure it has increased drastically seeing as my 2 or 3rm have all increased overall vince is a awesome and very patient coach ",
        "pic_path": "10.jpg"
    },
    {
        "idtestimonials": 11,
        "name": "Albert R. Tamayo",
        "testimonial": "Coach Vince is the quintessential coach!  His knowledge and hands-on approach is second to none. As an X-Olympic athlete I have been exposed to many coaches and trainers throughout my long athletic journey. I applaud Coach Vince's pursuit in perfecting techniques and motivating you to become the best version of yourself.  I'm anxious and excited for my next session with Coach Vince. ",
        "pic_path": "11.jpg"
    },
    {
        "idtestimonials": 12,
        "name": "Erika Lamb",
        "testimonial": "Anyone that knows me knows the love and respect I have for Vince as my coach. Since he's been my coach my lifts have exponentially increased and my technique has gotten 1000% better. I recommend him to anyone and everyone all the time. He's one of the best out and the sauciest in the game.",
        "pic_path": "12.jpg"
    },
    {
        "idtestimonials": 13,
        "name": "Guillermo Casal",
        "testimonial": "Vincent is a very knowledgeable coach and a great person. During the 5 months of training he helped me prep for my first powerlifting meet, increased my strength in all three lifts and improved my technique.",
        "pic_path": "13.jpg"
    },
    {
        "idtestimonials": 14,
        "name": "Gregory Durant ",
        "testimonial": "Excellent feedback and amazing programming and coaching, one of the greatest decisions I've made as far as training goes. ",
        "pic_path": ""
    },
    {
        "idtestimonials": 15,
        "name": "Andrea Zurita",
        "testimonial": "Vince doesn't let me eat oreos, But thanks to him I can say I am great lifter today. I came to him with little experience about powerlifting, and little over a year i was able to increase my wilks by almost 100+ points. He also guided me to win best overall female lifter on 2017 florida collegiate state championship.  He has forsure being a blessing to my powerlifter career, and I want to thank him for keeping me on track and for his patience! I recommend him to any new lifter or even old lifters. He is the way to go. ",
        "pic_path": "15.jpg"
    },
    {
        "idtestimonials": 16,
        "name": "Jake Lopez",
        "testimonial": "Prior to being coached by Vince I was running a popular cookie-cutter powerlifting program I found online. After training with Vince for almost a year I can't imagine going back. The personalized programming and input on my lifts have all contributed to the progress I've made since starting.",
        "pic_path": ""
    },
    {
        "idtestimonials": 17,
        "name": "Megan Rodriguez",
        "testimonial": "Vince is very educated and passionate about his clients reaching their goals. He is always available and responds quickly to any questions or concerns you may have, showing he truly cares. He's been coaching me for about 6 months, and in that short time I have increased my squat by 22lbs, my bench by 33lbs, and my deadlift by 44lbs. ",
        "pic_path": "17.jpg"
    },
    {
        "idtestimonials": 18,
        "name": "Bryan Alcarazo",
        "testimonial": "Vince, I am amazed by both your ability as a coach and patience with clients. Knowing myself, I can definitely imagine how much of a pain it can be when I go off program but the progress that I have made with you has been unmatched in my powerlifting journey. Your attention to detail let's all those under your wing succeed, and your knowledge as a coach gives us the confidence that our programming is suitable for our specific needs. Thank you for everything.\np.s. My back is feeling good but I still haven't tried pulling :))))",
        "pic_path": ""
    },
    {
        "idtestimonials": 19,
        "name": "Rodrigo Villeda",
        "testimonial": "Thanks to Vince I have gotten stronger than I've ever been, and we are only getting started. ",
        "pic_path": "19.png"
    },
    {
        "idtestimonials": 20,
        "name": "Jackson Burch",
        "testimonial": "Vince has really changed the way I lift. I used to be a crazy who went maximum effort every training session,  Vince changed this and put me on the path of becoming a technician and being more mindful of my lifts. Not only did I become a better lifter, but since starting with Vince I gained 300lbs on my total and a friend. Vince's client base is also extremely knowledgeable and always look to help eachother out and will always take new lifters in with open arms.",
        "pic_path": "20.jpg"
    },
    {
        "idtestimonials": 21,
        "name": "Sam London",
        "testimonial": "Vince's coaching took me from being a novice lifter, into a fully structured powerlifter. Whether it be   simple periodization, or overcoming setbacks and obstacles Vince got me through it all, and I'm a better, stronger, and smarter powerlifter now because of it.",
        "pic_path": "21.png"
    },
    {
        "idtestimonials": 22,
        "name": "Daniel Rodriguez",
        "testimonial": "Vince has been an incredible addition to my Powerlifting journey. His coaching lays the foundation for you to be feeling strong and ready to go on meet day. He is always there to provide feedback and answer any questions or concerns you may have. Coming off from my first meet now, I am looking forward to what the future holds for me in the sport, especially knowing I have Vince in my corner. ",
        "pic_path": ""
    },
    {
        "idtestimonials": 23,
        "name": "Ricardo Porro",
        "testimonial": "If it wasn't for Coach Vince I wouldn't be where I am today. At first I was just blindly lifting but thanks to his programming and coaching I was able to compete in my first meet and lift on par with some strong people. The best coach there is. ",
        "pic_path": "23.png"
    },
    {
        "idtestimonials": 24,
        "name": "Stephen Tham",
        "testimonial": "I appreciate everything that Vince does for me! In terms of his programming, he knows what he is doing. Vince has taken me to the next level when it comes to training. I made drastic improvements in numbers on all my lifts. Vince brings out the best in everyone! He is a great coach! ",
        "pic_path": "24.png"
    },
    {
        "idtestimonials": 25,
        "name": "Reyly Bonilla",
        "testimonial": "Excellent programming and very easy to communicate with about day to day progress, very knowledgeable and can't imagine getting coached by anyone else. Since starting I've been able to increase my total by almost 200 lbs in 6 months, and not bomb out on my first meet.",
        "pic_path": "25.jpg"
    },
    {
        "idtestimonials": 26,
        "name": "Andres Rodriguez",
        "testimonial": "Coach Vince has been something else. He added 200 lbs to my total in 5 months which is insane for an intermediate athlete. On top of that, in 7 months, he added 35 lbs to my bench and coached me for my all time bench PR of 347.  Vince has helped me through aches and pains and pointed me in the right directions all the way through. He aided tremendously in my 3rd place placing in 93kg for my first meet at Florida State collegiates. I have full faith in Vince to coach me towards a 405 bench for the future as well as making me a strong powerlifter.",
        "pic_path": ""
    },
    {
        "idtestimonials": 27,
        "name": "Nathalia Balderrama",
        "testimonial": "for my first time being coached in powerlifting, i didn't know what to expect. but with my previous coaching experiences i was never given the opportunity to explore my options and also be coached at the same time. with vince i was able to train the way i wanted while still being in a program that i followed, and i saw the difference with my numbers on a daily. it's also cool training with people that have the same coach and way of training as me because it's easier to get their feedback as well.",
        "pic_path": "27.jpg"
    },
    {
        "idtestimonials": 28,
        "name": "Anthony Fontan",
        "testimonial": "Vince has been instrumental in my progression through the sport of powerlifting. All my lifts shot up tremendously since I've started working with him, and I would be completely lost in the sport without him. I would highly recommend him to anyone thinking of trying powerlifting.",
        "pic_path": "28.jpg"
    },
    {
        "idtestimonials": 29,
        "name": "Brandon Galloway",
        "testimonial": "Coach Vincent is an exceptional source of information who remains calm under pressure resulting in a positive & comfortable meet day; Vince's flexible and structured programming prepared me to gain strength while losing weight/body fat, leading me to a 408 Wilks and 3x body weight pull in my first meet even after watercutting 5kg the day before ",
        "pic_path": "29.png"
    },
    {
        "idtestimonials": 30,
        "name": "Ashley Garcia",
        "testimonial": "Amazing coach. Super quick to reply, always alters the programming if you need something different, helpful feedback whenever I ask. ",
        "pic_path": ""
    },
    {
        "idtestimonials": 31,
        "name": "Kathleen Lopez",
        "testimonial": "My experience with Vince's coaching has been phenomenal. Not only did I drastically improve as a lifter but have a deeper understanding of how my body functions in reference to performance. ",
        "pic_path": "31.jpg"
    },
    {
        "idtestimonials": 32,
        "name": "Hernestor Torres ",
        "testimonial": "My technique and form have undeniably improved since working with Vince. I couldn't be happier with his coaching and guidance. ",
        "pic_path": "32.jpg"
    },
    {
        "idtestimonials": 33,
        "name": "Francisco Dos Santos",
        "testimonial": "I added 150lbs on my 3 lifts with Vince and he helped me prepare for my first competition. My lower body lifts had stalled for about a year and they just exploded when we started working together. He always answered any questions I had about training and competing. I look forward to breaking many more PRs with Vince.",
        "pic_path": ""
    },
    {
        "idtestimonials": 34,
        "name": "Daunid Cordero",
        "testimonial": "Vince's coaching and programming has been absolutely amazing. In the short time that I've been with him my overall total has shot up into numbers I never thought I'd reach before. Everything is moving quicker and I wouldn't be where I'm at today without his guidance and patience with me. I'm more than excited to continue his program and I know there is more to come out of it. ",
        "pic_path": "34.png"
    },
    {
        "idtestimonials": 35,
        "name": "Edgard Paguaga",
        "testimonial": "Great coach, great programming, great person",
        "pic_path": "35.jpg"
    },
    {
        "idtestimonials": 36,
        "name": "Ana Soneira-Saiz",
        "testimonial": "Had been training with my friends on the FIU powerlifting team for awhile and was recommended to Vince when I got serious about the sport and signed up for my first meet. Being on a program has helped me feel more confident in my abilities as a lifter, and Vince always answers my questions/concerns in a timely manner. I just competed in my second meet and my total went up by almost 40 kilos! Vince knows his stuff and I would highly recommend him to anyone in need of a great coach! ",
        "pic_path": "36.jpg"
    },
    {
        "idtestimonials": 37,
        "name": "Kevin Mata",
        "testimonial": "After watching one of my close friends compete in a powerlifting meet, I felt motivated to take my workouts a lot more seriously and compete in this sport. That same friend had been using Vince's services and strongly recommended that I should enlist in his services as well. It was by far the best decision I made in regards to my lifting. Vince is an excellent coach and was very patient with me as he taught a complete novice the ins and outs of preparing for my first powerlifting meet. His knowledge of programing and the sport continuously showed me that I was always capable of more than I thought. With that said, my first meet was a success and with Vince coaching me through it, I performed with more weight than I thought I could lift and I cannot wait until we start preparing for the next Powerlifting meet!",
        "pic_path": "37.png"
    },
    {
        "idtestimonials": 38,
        "name": "Christopher Ramirez",
        "testimonial": "Put on almost 300 pounds to my total in 23 weeks. Always responds to your questions/concerns. If you live in the Miami area he's willing to see you in person and fix whatever problem you have with technique.",
        "pic_path": "38.jpg"
    },
    {
        "idtestimonials": 39,
        "name": "Steven Familia ",
        "testimonial": "VVSC helped me prepare for my first ever powerlifting meet. He is a very helpful coach he always cares about his athletes well being making sure they're healthy and ready to get to work. Very excited to continue to work with the VVSC team !",
        "pic_path": "39.png"
    },
    {
        "idtestimonials": 40,
        "name": "Andrew Kirkpatrick ",
        "testimonial": "Vince is a great coach. He started with the basics and then got me into more advanced things. He also helped me adjust the program really well according to how I was feeling. I'm glad I got to meet him and his team, they're all great! ",
        "pic_path": ""
    },
    {
        "idtestimonials": 41,
        "name": "Jacquelyn Gutierrez ",
        "testimonial": "I love working with Vince! In only 3 months I've been able to make huge strength gains and compete in my first ever powerlifting meet. He's been able to give me great feedback on my form and answered my millions of questions. Getting into powerlifting and competing is scary at first but he always helped ease my fears. I felt much better having him at the meet with me. Can't wait to keep growing and getting stronger!",
        "pic_path": "41.jpg"
    },
    {
        "idtestimonials": 42,
        "name": "Daniel Martinez",
        "testimonial": "I had been battling patellar tendonitis in both knees for months, but after working with Vince for around 3 months, my pain was gone. All while adding 100lbs to my deadlift and 80lbs to my squat.\n\nVince's vast experience in programming for strength athletes and genuine concern for his clients is why I will always recommend his services to anyone looking for sustainable results. ",
        "pic_path": ""
    },
    {
        "idtestimonials": 43,
        "name": "Alvaro Calle",
        "testimonial": "In as few words as possible, Vincent is a role model. Not only does this man have the patience of a Saint but the degree of flexibility, adaptability or simply speaking the openness he has for the needs of his clients is simply unmatchable. Through him I have not only become significantly stronger as a lifter, but smarter, more disciplined, and only half as reckless as I was over a year ago. He leads and coaches through example as well as identifies and facilitates individual potential.",
        "pic_path": "43.jpg"
    },
    {
        "idtestimonials": 51,
        "name": "Anthony Ham",
        "testimonial": "This man knows his stuff and is. Always giving feedback and making sure training is going how it should. I went from dealing with an injury to adding roughly 140lbs to my total in 6 months, injury free. Great coach and lifter himself.",
        "pic_path": "51.jpg"
    },
    {
        "idtestimonials": 52,
        "name": "Moises Rodriguez",
        "testimonial": "Amazing coach, Vince has helped me pass not only physical limitations but also my mental limitations! His style of coaching makes you feel like you have a best friend, not just coach.",
        "pic_path": "52.jpg"
    }
]